In [ ]:
from google.colab import drive
import matplotlib.pyplot as plt

## Mount your Google Drive

In [ ]:
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

# Load the student Data

In [ ]:
import pandas as pd
import glob, os

data_dir= '/content/gdrive/My Drive/AIM Test File for Import/'
filename = 'AIM Summit Export.csv'
os.chdir(data_dir)

df=pd.read_csv(filename)

print("Column headings:")
print(df.columns)

Column headings:
Index(['School Id', 'Student First', 'Student Last', 'Student Email',
       'Student Current Grade Level', 'Student Last Access Time', 'Mentors',
       'Sections', 'Course Name', 'Course Academic Year', 'Course Subject',
       'Letter Grade', 'Overall Score', 'Ungraded Projects',
       'Overdue Projects', 'Graded Projects', 'Exempted Projects',
       'Total Projects', 'Power FAs Mastered', 'Power FAs Behind',
       'Total Power FAs', 'Power FA %', 'Additional FAs Mastered',
       'Additional FAs Total', 'Additional FA %',
       'Date of Last Content Assessment Attempted',
       'Date of Last Content Assessment Passed', 'Cog Skill %',
       'Cog Skill Avg', 'Concept %', 'Concept Skill Avg', 'Incomplete?',
       'Date of Last Grade Change'],
      dtype='object')

In [ ]:
!ls

'AIM Summit Export.csv'       output.xlsx	  SummitLearning.ipynb
'Class List on Synergy.CSV'   StudentGrades.xls

In [ ]:
template = pd.read_excel('StudentGrades.xls')

In [ ]:
template.columns

Index(['SIS_NUMBER', 'SCHOOL_CODE', 'SCHOOL_YEAR', 'GRADING_TERM', 'MARK_NAME',
       'SECTION_ID', 'ABS1', 'ABS2', 'ABS3', 'ABS4', 'ABS5', 'ABS6', 'CONDUCT',
       'CITIZENSHIP', 'WORKHABITS', 'GRADE_MARK', 'COMMENT_1', 'COMMENT_2',
       'COMMENT_3', 'COMMENT_4', 'COMMENT_5', 'COMMENT_6', 'COMMENT_7',
       'COMMENT_8', 'COMMENT_9', 'TEACHER_AD_HOC_COMMENT'],
      dtype='object')

In [ ]:
classs = pd.read_csv('Class List on Synergy.CSV')

In [ ]:
classs.rename(columns={"Local ID": "SIS_NUMBER",'Section ID':'SECTION_ID' }, inplace=True)

In [ ]:
classs.head()

   Period          SECTION_ID  Grd  ... Male Audit Class Meeting Days
0       3  400181MATH08-3-002    8  ...    0           N        MTTHF
1       3  400181MATH08-3-002    8  ...    0           N        MTTHF
2       3  400181MATH08-3-002    8  ...    1           N        MTTHF
3       4  400181ENGL08-4-002    8  ...    0           N        MTTHF
4       4  400181ENGL08-4-002    8  ...    0           N        MTTHF

[5 rows x 30 columns]

In [ ]:
df.rename(columns={"School Id": "SIS_NUMBER", 'Letter Grade':'GRADE_MARK'}, inplace=True)

In [ ]:
df.head()

   SIS_NUMBER Student First  ... Incomplete? Date of Last Grade Change
0    60039674         Kaleb  ...  Incomplete           3/18/2020 11:06
1    60039674         Kaleb  ...  Incomplete           3/12/2020 14:55
2    60039674         Kaleb  ...  Incomplete           3/18/2020 14:46
3    60039674         Kaleb  ...  Incomplete           1/30/2020 15:35
4    60039864        Kalynn  ...  Incomplete           3/18/2020 11:06

[5 rows x 33 columns]

In [ ]:
classs.columns

Index(['Period', 'SECTION_ID', 'Grd', 'Enter Date', 'Student Name',
       'Ethnic Code', 'SIS_NUMBER', 'Birth Date', 'Home Language', 'Phone',
       'IL State ID', 'Ed-Fi ID', 'Trk', 'House', 'Team', 'Pathways House',
       'Pathways Team', 'Counselor', 'Course ID', 'Course Title', 'Staff Name',
       'Room Name', 'Student School Year GU', 'Student GU', 'Gen', 'Female',
       'Track', 'Male', 'Audit Class', 'Meeting Days'],
      dtype='object')

In [ ]:
ck=['SECTION_ID', 'SIS_NUMBER','Course Title']

In [ ]:
cc= classs[ck]

In [ ]:
cc.head()

           SECTION_ID  SIS_NUMBER Course Title
0  400181MATH08-3-002    44480522       Math 8
1  400181MATH08-3-002    50093848       Math 8
2  400181MATH08-3-002    50065652       Math 8
3  400181ENGL08-4-002    44480522    English 8
4  400181ENGL08-4-002    50093848    English 8

In [ ]:
cc['Course Title'].unique()

array(['Math 8', 'English 8', 'English 7', 'History 7', 'Math 7',
       'Science 7', 'Science 8', 'History 8'], dtype=object)

In [ ]:
df[['Course Title','pahun_2']]=df['Sections'].str.split(' - ', expand=True,n=1)

In [ ]:
df.head()

   SIS_NUMBER Student First  ... Course Title        pahun_2
0    60039674         Kaleb  ...    English 7  Drumgoole - 2
1    60039674         Kaleb  ...    Science 7     Milton - 9
2    60039674         Kaleb  ...       Math 7      Hicks - 4
3    60039674         Kaleb  ...    History 7     Bryant - 8
4    60039864        Kalynn  ...    English 7  Drumgoole - 4

[5 rows x 35 columns]

In [ ]:
template.head()

   SIS_NUMBER  SCHOOL_CODE  ...  COMMENT_9 TEACHER_AD_HOC_COMMENT
0         NaN       400181  ...        NaN                    NaN

[1 rows x 26 columns]

In [ ]:
keep =['SIS_NUMBER', 'Course Title',  
       'GRADE_MARK']

In [ ]:
df=df[keep]

In [ ]:
df.shape

(776, 3)

In [ ]:
cc.shape

(803, 3)

In [ ]:
rv = pd.merge(df, cc, on=['SIS_NUMBER','Course Title'])

In [ ]:
print("Loaded data has shape {}".format(rv.shape))

Loaded data has shape (776, 4)

In [ ]:
rv.head()

   SIS_NUMBER Course Title GRADE_MARK          SECTION_ID
0    60039674    English 7          I  400181ENGL07-1-001
1    60039674    Science 7          I  400181SCIE07-10-01
2    60039674       Math 7          I  400181MATH07-4-001
3    60039674    History 7          I  400181HIST07-8-001
4    60039864    English 7          I  400181ENGL07-1-003

In [ ]:
rv = template.append(rv, sort=False)

In [ ]:
rv = rv.drop(rv.index[0])

In [ ]:
rv['SCHOOL_CODE'] = 400181

In [ ]:
rv['SCHOOL_YEAR'] = 2009

In [ ]:
rv.head()

   SIS_NUMBER  SCHOOL_CODE  ...  COMMENT_9 TEACHER_AD_HOC_COMMENT
1  60039674.0       400181  ...        NaN                    NaN
2  60039674.0       400181  ...        NaN                    NaN
3  60039674.0       400181  ...        NaN                    NaN
4  60039864.0       400181  ...        NaN                    NaN
5  60039864.0       400181  ...        NaN                    NaN

[5 rows x 26 columns]

In [ ]:
rv =rv.drop('Course Title', axis=1)

In [ ]:
rv.to_excel("output.xlsx")